xml/Enums/ИИА_АвторСообщения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ИИА_АвторСообщения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Пользователь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИИ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Система</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

xml/Enums/ИИА_ТипСообщения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ИИА_ТипСообщения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Текст</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Запрос</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Код</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

xml/CommonModules/ИИА_RuntimeФакты/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Извлекает блок "Реквизиты:" из текста фактов (результатов GetObjectFields) для передачи в промпт RunQuery
//
// Параметры:
//  ТекстФактов - Строка - текст из СобратьФактыПоследнихДействий
//
// Возвращаемое значение:
//  Строка - извлечённый список реквизитов или пустая строка
//
Функция ИзвлечьРеквизитыИзФактов(ТекстФактов) Экспорт
	
	Если ПустаяСтрока(ТекстФактов) Тогда
		Возврат "";
	КонецЕсли;
	
	ПозРеквизиты = СтрНайти(ТекстФактов, "Реквизиты:");
	Если ПозРеквизиты <= 0 Тогда
		Возврат "";
	КонецЕсли;
	
	Начало = ПозРеквизиты + СтрДлина("Реквизиты:");
	Остаток = Сред(ТекстФактов, Начало);
	
	Маркеры = Новый Массив;
	Маркеры.Добавить("""steps""");
	Маркеры.Добавить("dsl_system_result");
	Маркеры.Добавить("Выполнен DSL");
	Маркеры.Добавить("Ошибка выполнения");
	
	КонецБлока = СтрДлина(Остаток) + 1;
	Для Каждого Маркер Из Маркеры Цикл
		Поз = СтрНайти(Остаток, Маркер);
		Если Поз > 0 И Поз < КонецБлока Тогда
			КонецБлока = Поз;
		КонецЕсли;
	КонецЦикла;
	
	БлокРеквизитов = Лев(Остаток, КонецБлока - 1);
	БлокРеквизитов = СокрЛП(БлокРеквизитов);
	
	Если СтрДлина(БлокРеквизитов) > 1500 Тогда
		БлокРеквизитов = Лев(БлокРеквизитов, 1500) + "...";
	КонецЕсли;
	
	Возврат БлокРеквизитов;
	
КонецФункции

// Извлекает имена объектов/таблиц, по которым уже была ошибка (таблица не найдена, поле не найдено).
// Используется для запрета возврата к ошибочным объектам в промпте генерации DSL.
//
// Параметры:
//  ТекстФактов - Строка - текст из СобратьФактыПоследнихДействий
//
// Возвращаемое значение:
//  Строка - список имён через запятую или пустая строка
//
Функция СобратьНеудачныеОбъектыИзФактов(ТекстФактов) Экспорт
	
	Если ПустаяСтрока(ТекстФактов) Тогда
		Возврат "";
	КонецЕсли;
	
	Уникальные = Новый Соответствие;
	
	Поз = 1;
	Пока Истина Цикл
		ПозТабл = СтрНайти(Сред(ТекстФактов, Поз), "Таблица ");
		Если ПозТабл <= 0 Тогда
			Прервать;
		КонецЕсли;
		Поз = Поз + ПозТабл + 7;
		Остаток = Сред(ТекстФактов, Поз);
		ПозКавычки = СтрНайти(Остаток, "'");
		Если ПозКавычки <= 0 Тогда
			ПозКавычки = СтрНайти(Остаток, """");
		КонецЕсли;
		Если ПозКавычки > 0 Тогда
			Остаток = Сред(Остаток, ПозКавычки + 1);
			ПозКонец = СтрНайти(Остаток, "'");
			Если ПозКонец <= 0 Тогда
				ПозКонец = СтрНайти(Остаток, """");
			КонецЕсли;
			Если ПозКонец > 0 Тогда
				ИмяТаблицы = Лев(Остаток, ПозКонец - 1);
				ИмяТаблицы = СтрЗаменить(ВРег(ИмяТаблицы), "ДОКУМЕНТ.", "");
				ИмяТаблицы = СтрЗаменить(ИмяТаблицы, "СПРАВОЧНИК.", "");
				ИмяТаблицы = СокрЛП(ИмяТаблицы);
				Если НЕ ПустаяСтрока(ИмяТаблицы) Тогда
					Уникальные.Вставить(ИмяТаблицы, Истина);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		Поз = Поз + 50;
		Если Поз > СтрДлина(ТекстФактов) Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Поз = 1;
	Пока Истина Цикл
		ПозПоле = СтрНайти(Сред(ТекстФактов, Поз), "Поле не найдено");
		Если ПозПоле <= 0 Тогда
			Прервать;
		КонецЕсли;
		Поз = Поз + ПозПоле + 14;
		Остаток = Сред(ТекстФактов, Поз);
		ПозКавычки = СтрНайти(Остаток, """");
		Если ПозКавычки <= 0 Тогда
			ПозКавычки = СтрНайти(Остаток, "'");
		КонецЕсли;
		Если ПозКавычки > 0 Тогда
			Остаток = Сред(Остаток, ПозКавычки + 1);
			ПозКонец = СтрНайти(Остаток, """");
			Если ПозКонец <= 0 Тогда
				ПозКонец = СтрНайти(Остаток, "'");
			КонецЕсли;
			Если ПозКонец > 0 Тогда
				ОбъектПоле = Лев(Остаток, ПозКонец - 1);
				ПозТочки = СтрНайти(ОбъектПоле, ".");
				Если ПозТочки > 0 Тогда
					ИмяОбъекта = Лев(ОбъектПоле, ПозТочки - 1);
					Если НЕ ПустаяСтрока(ИмяОбъекта) Тогда
						Уникальные.Вставить(ИмяОбъекта, Истина);
					КонецЕсли;
				Иначе
					Уникальные.Вставить(ОбъектПоле, Истина);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		Поз = Поз + 30;
		Если Поз > СтрДлина(ТекстФактов) Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Уникальные.Количество() = 0 Тогда
		Возврат "";
	КонецЕсли;
	
	Список = "";
	Для Каждого КлючЗначение Из Уникальные Цикл
		Если НЕ ПустаяСтрока(Список) Тогда
			Список = Список + ", ";
		КонецЕсли;
		Список = Список + КлючЗначение.Ключ;
	КонецЦикла;
	Возврат Список;
	
КонецФункции

// Извлекает ключ последней ошибки DSL из фактов (для детекции повторяющихся ошибок).
// Возвращает пустую строку, если последний результат - успех.
//
// Параметры:
//  ТекстФактов - Строка - текст из СобратьФактыПоследнихДействий
//
// Возвращаемое значение:
//  Строка - ключ ошибки ("RunQuery" + первые 50 символов сообщения) или ""
//
Функция ПолучитьКлючПоследнейОшибкиИзФактов(ТекстФактов) Экспорт
	
	Если ПустаяСтрока(ТекстФактов) Тогда
		Возврат "";
	КонецЕсли;
	
	ТекстВРег = ВРег(ТекстФактов);
	
	ПозErr = СтрНайти(ТекстВРег, "DSL RESULT: ERR");
	Если ПозErr > 0 Тогда
		Остаток = Сред(ТекстФактов, ПозErr);
		ПозВер = СтрНайти(Остаток, "|");
		Если ПозВер > 0 Тогда
			Сообщение = СокрЛП(Сред(Остаток, ПозВер + 1));
			Возврат "RunQuery" + Лев(Сообщение, 50);
		КонецЕсли;
		Возврат "RunQuery";
	КонецЕсли;
	
	Если СтрНайти(ТекстВРег, """SUCCESS"":FALSE") = 0 И СтрНайти(ТекстВРег, """SUCCESS"": FALSE") = 0 Тогда
		Возврат "";
	КонецЕсли;
	
	Чанки = СтрРазделить(ТекстФактов, "dsl_system_result", Ложь);
	Если Чанки.Количество() < 2 Тогда
		Возврат "RunQuery";
	КонецЕсли;
	
	ПоследнийЧанк = Чанки[Чанки.Количество() - 1];
	ПоследнийЧанкВРег = ВРег(ПоследнийЧанк);
	Если СтрНайти(ПоследнийЧанкВРег, """SUCCESS"":FALSE") = 0 И СтрНайти(ПоследнийЧанкВРег, """SUCCESS"": FALSE") = 0 Тогда
		Возврат "";
	КонецЕсли;
	
	ПозОшибки = СтрНайти(ПоследнийЧанк, """error"":""");
	Если ПозОшибки = 0 Тогда
		ПозОшибки = СтрНайти(ПоследнийЧанк, """error"": """);
	КонецЕсли;
	
	Если ПозОшибки > 0 Тогда
		Остаток = Сред(ПоследнийЧанк, ПозОшибки + 10);
		Ключ = "RunQuery" + Лев(Остаток, 50);
		Возврат Ключ;
	КонецЕсли;
	
	Возврат "RunQuery" + Лев(ПоследнийЧанк, 50);
	
КонецФункции

Функция СобратьФактыПоследнихДействий(СсылкаДиалога) Экспорт
	
	Диалог = СсылкаДиалога.ПолучитьОбъект();
	КоличествоСообщений = Диалог.Сообщения.Количество();
	
	МассивФрагментов = Новый Массив;
	СчетчикСистемных = 0;
	СчетчикDSL = 0;
	РеквизитыДобавлены = Ложь;
	МаксимумФрагмента = 1600;
	МаксимумВсего = 6000;
	
	Индекс = КоличествоСообщений - 1;
	Пока Индекс >= 0 Цикл
		СтрокаСообщения = Диалог.Сообщения[Индекс];
		
		АвторСообщения = СтрокаСообщения.Автор;
		ТипСообщения = СтрокаСообщения.ТипСообщения;
		
		Если АвторСообщения = Перечисления.ИИА_АвторСообщения.Система
			ИЛИ АвторСообщения = Перечисления.ИИА_АвторСообщения.ИИ Тогда
			
			Если АвторСообщения = Перечисления.ИИА_АвторСообщения.ИИ И НЕ ПустаяСтрока(СтрокаСообщения.ТекстКода) Тогда
				ТекстСообщения = СтрокаСообщения.ТекстКода;
			Иначе
				ТекстСообщения = СтрокаСообщения.Текст;
			КонецЕсли;
			ТекстСообщения = СокрЛП(ТекстСообщения);
			
			Если ПустаяСтрока(ТекстСообщения) Тогда
				Индекс = Индекс - 1;
				Продолжить;
			КонецЕсли;
			
			ЭтоРезультат = (СтрНайти(ТекстСообщения, "dsl_system_result") > 0);
			ЭтоОшибка = (ТипСообщения = Перечисления.ИИА_ТипСообщения.Ошибка);
			ЭтоРеквизиты = (АвторСообщения = Перечисления.ИИА_АвторСообщения.Система И СтрНайти(ТекстСообщения, "Реквизиты:") > 0);
			ЭтоDSL = (АвторСообщения = Перечисления.ИИА_АвторСообщения.ИИ И НЕ ПустаяСтрока(СтрокаСообщения.ТекстКода));
			
			Если ЭтоРезультат ИЛИ ЭтоОшибка Тогда
				Если СчетчикСистемных < 5 Тогда
					СчетчикСистемных = СчетчикСистемных + 1;
					
					Если ЭтоРезультат Тогда
						ТекстДляДобавления = ИИА_Сервер.ФорматироватьКомпактноДляЛога(ТекстСообщения);
					Иначе
						ТекстДляДобавления = ТекстСообщения;
					КонецЕсли;
					Если СтрДлина(ТекстДляДобавления) > МаксимумФрагмента Тогда
						ТекстДляДобавления = Лев(ТекстДляДобавления, МаксимумФрагмента) + "...(truncated)";
					КонецЕсли;
					
					МассивФрагментов.Вставить(0, ТекстДляДобавления);
				КонецЕсли;
			ИначеЕсли ЭтоРеквизиты И НЕ РеквизитыДобавлены Тогда
				РеквизитыДобавлены = Истина;
				ТекстДляДобавления = ТекстСообщения;
				Если СтрДлина(ТекстДляДобавления) > 2500 Тогда
					ТекстДляДобавления = Лев(ТекстДляДобавления, 2500) + "...(truncated)";
				КонецЕсли;
				МассивФрагментов.Вставить(0, ТекстДляДобавления);
			ИначеЕсли ЭтоDSL Тогда
				Если СчетчикDSL < 5 Тогда
					СчетчикDSL = СчетчикDSL + 1;
					ТекстDSL = ИИА_Сервер.ФорматироватьКомпактноДляЛога(ТекстСообщения);
					Если СтрДлина(ТекстDSL) > МаксимумФрагмента Тогда
						ТекстDSL = Лев(ТекстDSL, МаксимумФрагмента) + "...(truncated)";
					КонецЕсли;
					МассивФрагментов.Вставить(0, "Выполнен " + ТекстDSL);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если СчетчикСистемных >= 5 И СчетчикDSL >= 5 Тогда
			Прервать;
		КонецЕсли;
		
		Индекс = Индекс - 1;
	КонецЦикла;
	
	ТекстРезультатов = "";
	Для Каждого Фрагмент Из МассивФрагментов Цикл
		Если НЕ ПустаяСтрока(ТекстРезультатов) Тогда
			ТекстРезультатов = ТекстРезультатов + Символы.ПС;
		КонецЕсли;
		ТекстРезультатов = ТекстРезультатов + Фрагмент;
		Если СтрДлина(ТекстРезультатов) > МаксимумВсего Тогда
			ТекстРезультатов = Лев(ТекстРезультатов, МаксимумВсего) + Символы.ПС + "...(facts truncated)";
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТекстРезультатов;
	
КонецФункции

#КонецОбласти
